

##### EOAM Basic Test #####


config terminal

LAB1# 
LAB1# ##### EOAM Basic Test #####
LAB1# 
LAB1# 
LAB1# 

end
config terminal
ethernet service add evc1
svlan 1
service type evpl


end
config terminal
ethernet nni add nni1
map interface 1/25

add service evc1


end
config terminal
ethernet uni add uni1
config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# 
LAB1(config)# 
LAB1(config)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet service add evc1
LAB1(config-svc)# svlan 1
LAB1(config-svc)# service type evpl
LAB1(config-svc)# 
LAB1(config-svc)# 
LAB1(config-svc)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet nni add nni1
LAB1(config-nni)# map interface 1/25
LAB1(config-nni)# 
LAB1(config-nni)# add service evc1
LAB1(config-nni)# 
LAB1(config-nni)# 
LAB1(config-nni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# map interface 1/1
all-to-one-bundling disable
multiplex enable
bundling enable
max-svc 256


end
config terminal
ethernet uni uni1
add service evc1


end
config terminal
ethernet sep uni1-evc1
add vlan 1-4095


end
config terminal
interface 1/25
ethernet oam enable
ethernet uni add uni1
LAB1(config-uni)# map interface 1/1
LAB1(config-uni)# all-to-one-bundling disable
LAB1(config-uni)# multiplex enable
LAB1(config-uni)# bundling enable
LAB1(config-uni)# max-svc 256
LAB1(config-uni)# 
LAB1(config-uni)# 
LAB1(config-uni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet uni uni1
LAB1(config-uni)# add service evc1
LAB1(config-uni)# 
LAB1(config-uni)# 
LAB1(config-uni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet sep uni1-evc1
LAB1(config-ep)# add vlan 1-4095
LAB1(config-ep)# 
LAB1(config-ep)# 
LAB1(config-ep)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# interface 1/25
LAB1(config-if)# ethernet oam mode active


end
config terminal
interface 1/25
ethernet oam enable
ethernet oam mode passive


end
config terminal
interface 1/25
ethernet oam enable
ethernet oam mode active


end
config terminal
interface 1/25
no ethernet oam link-event dying-gasp enable




end
config terminal
interface 1/25
ethernet oam enable
LAB1(config-if)# ethernet oam mode active
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# interface 1/25
LAB1(config-if)# ethernet oam enable
LAB1(config-if)# ethernet oam mode passive
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# interface 1/25
LAB1(config-if)# ethernet oam enable
LAB1(config-if)# ethernet oam mode active
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# interface 1/25
LAB1(config-if)# no ethernet oam link-event dying-gasp enable
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# no ethernet oam link-event link-fault enable




end
config terminal
interface 1/25
ethernet oam link-monitor on 
ethernet oam link-monitor supported


end
ethernet oam remote-loopback test packet-count 15
ethernet oam remote-loopback test packet-size 1500 
ethernet oam remote-loopback start interface 1/25  
ethernet oam remote-loopback test start   
ethernet oam remote-loopback stop interface 1/25 
config terminal
ethernet uni uni1
del service evc1
no map interface
ethernet uni del uni1


end
config terminal
ethernet nni nni1
del service evc1
ethernet nni del nni1


end
interface 1/25
LAB1(config-if)# no ethernet oam link-event link-fault enable
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# interface 1/25
LAB1(config-if)# ethernet oam link-monitor on 
LAB1(config-if)# ethernet oam link-monitor supported
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# end
LAB1# ethernet oam remote-loopback test packet-count 15
LAB1# ethernet oam remote-loopback test packet-size 1500 
LAB1# ethernet oam remote-loopback start interface 1/25  
LAB1# ethernet oam remote-loopback test start   
LAB1# ethernet oam remote-loopback stop interface 1/25 
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet uni uni1
LAB1(config-uni)# del service evc1
LAB1(config-uni)# no map interface
LAB1(config-uni)# ethernet uni del uni1
LAB1(config)# 
LAB1(config)# 
LAB1(config)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet nni nni1
LAB1(config-nni)# del service evc1
LAB1(config-nni)# ethernet nni del nni1
LAB1(config)# 
LAB1(config)# 
LAB1(config)# config terminal
ethernet service del evc1


end
config terminal


end
config terminal
interface 1/25
ethernet oam disable


end
