

##### LLDP Basic Test #####


config terminal

LAB1# 
LAB1# ##### LLDP Basic Test #####
LAB1# 
LAB1# 
LAB1# 

vlan 2-2


end
config terminal
ethernet service add evc1
svlan 1
service type evpl
ethernet service add evc2
svlan 2
service type evpl


end
config terminal
ethernet nni add nni1
config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# 
LAB1(config)# 
LAB1(config)# vlan 2-2
LAB1(config-vlan)# 
LAB1(config-vlan)# 
LAB1(config-vlan)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet service add evc1
LAB1(config-svc)# svlan 1
LAB1(config-svc)# service type evpl
LAB1(config-svc)# ethernet service add evc2
LAB1(config-svc)# svlan 2
LAB1(config-svc)# service type evpl
LAB1(config-svc)# 
LAB1(config-svc)# 
LAB1(config-svc)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# map interface 1/25

add service evc1
add service evc2


end
config terminal
ethernet uni add uni1
map interface 1/1
all-to-one-bundling disable
multiplex enable
bundling enable
max-svc 256


end
config terminal
ethernet uni uni1
add service evc1
add service evc2


ethernet nni add nni1
LAB1(config-nni)# map interface 1/25
LAB1(config-nni)# 
LAB1(config-nni)# add service evc1
LAB1(config-nni)# add service evc2
LAB1(config-nni)# 
LAB1(config-nni)# 
LAB1(config-nni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet uni add uni1
LAB1(config-uni)# map interface 1/1
LAB1(config-uni)# all-to-one-bundling disable
LAB1(config-uni)# multiplex enable
LAB1(config-uni)# bundling enable
LAB1(config-uni)# max-svc 256
LAB1(config-uni)# 
LAB1(config-uni)# 
LAB1(config-uni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet uni uni1
LAB1(config-uni)# add service evc1
LAB1(config-uni)# add service evc2
LAB1(config-uni)# end
config terminal
ethernet sep uni1-evc1
add vlan 1-2047
ethernet sep uni1-evc2
add vlan 2048-4095


end
config terminal
interface 1/25
lldp disable


end
config terminal
interface 1/25
lldp enable txrx


end
config terminal
interface 1/25
no lldp tlv-select 8021-org-spec port-protocol-vid
no lldp tlv-select 8021-org-spec port-vid

LAB1(config-uni)# 
LAB1(config-uni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet sep uni1-evc1
LAB1(config-ep)# add vlan 1-2047
LAB1(config-ep)# ethernet sep uni1-evc2
LAB1(config-ep)# add vlan 2048-4095
LAB1(config-ep)# 
LAB1(config-ep)# 
LAB1(config-ep)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# interface 1/25
LAB1(config-if)# lldp disable
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# interface 1/25
LAB1(config-if)# lldp enable txrx
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# interface 1/25
LAB1(config-if)# no lldp tlv-select 8021-org-spec port-protocol-vid
LAB1(config-if)# no lldp tlv-select 8021-org-spec protocol-identity
no lldp tlv-select 8021-org-spec vlan-name
no lldp tlv-select 8023-org-spec link-aggregation
no lldp tlv-select 8023-org-spec mac-phy-cfg
no lldp tlv-select 8023-org-spec max-frame-size
no lldp tlv-select 8023-org-spec power
no lldp tlv-select 8023-org-spec preemption-capability
no lldp tlv-select basic management-address
no lldp tlv-select basic port-description
no lldp tlv-select basic system-capabilities
no lldp tlv-select basic system-description 
no lldp tlv-select basic system-name
 lldp tlv-select 8021-org-spec port-protocol-vid
 lldp tlv-select 8021-org-spec port-vid
 lldp tlv-select 8021-org-spec protocol-identity
 lldp tlv-select 8021-org-spec vlan-name
 lldp tlv-select 8023-org-spec link-aggregation
 lldp tlv-select 8023-org-spec mac-phy-cfg
 lldp tlv-select 8023-org-spec max-frame-size
 lldp tlv-select 8023-org-spec power
 lldp tlv-select 8023-org-spec preemption-capability
 lldp tlv-select basic management-address
 lldp tlv-select basic port-description
 lldp tlv-select basic system-capabilities
 lldp tlv-select basic system-description 
 lldp tlv-select basic system-name
no lldp tlv-select 8021-org-spec port-vid
LAB1(config-if)# no lldp tlv-select 8021-org-spec protocol-identity
LAB1(config-if)# no lldp tlv-select 8021-org-spec vlan-name
LAB1(config-if)# no lldp tlv-select 8023-org-spec link-aggregation
LAB1(config-if)# no lldp tlv-select 8023-org-spec mac-phy-cfg
LAB1(config-if)# no lldp tlv-select 8023-org-spec max-frame-size
LAB1(config-if)# no lldp tlv-select 8023-org-spec power
LAB1(config-if)# no lldp tlv-select 8023-org-spec preemption-capability
LAB1(config-if)# no lldp tlv-select basic management-address
LAB1(config-if)# no lldp tlv-select basic port-description
LAB1(config-if)# no lldp tlv-select basic system-capabilities
LAB1(config-if)# no lldp tlv-select basic system-description 
LAB1(config-if)# no lldp tlv-select basic system-name
LAB1(config-if)#  lldp tlv-select 8021-org-spec port-protocol-vid
LAB1(config-if)#  lldp tlv-select 8021-org-spec port-vid
LAB1(config-if)#  lldp tlv-select 8021-org-spec protocol-identity
LAB1(config-if)#  lldp tlv-select 8021-org-spec vlan-name
LAB1(config-if)#  lldp tlv-select 8023-org-spec link-aggregation
LAB1(config-if)#  lldp tlv-select 8023-org-spec mac-phy-cfg
LAB1(config-if)#  lldp tlv-select 8023-org-spec max-frame-size
LAB1(config-if)#  lldp tlv-select 8023-org-spec power
LAB1(config-if)#  lldp tlv-select 8023-org-spec preemption-capability
LAB1(config-if)#  lldp tlv-select basic management-address
LAB1(config-if)#  lldp tlv-select basic port-description
LAB1(config-if)#  lldp tlv-select basic system-capabilities
LAB1(config-if)#  lldp tlv-select basic system-description 
LAB1(config-if)# 

end
config terminal
lldp tlv-set management-address-tlv mac-address


end
config terminal
lldp holdtime-multiplier 4
lldp tx-interval 10


end
config terminal
system management-address vlan 1 v6


end
config terminal
ethernet uni uni1
del service evc1
del service evc2
no map interface
ethernet uni del uni1


end
config terminal
ethernet nni nni1
del service evc1
 lldp tlv-select basic system-name
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# lldp tlv-set management-address-tlv mac-address
LAB1(config)# 
LAB1(config)# 
LAB1(config)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# lldp holdtime-multiplier 4
LAB1(config)# lldp tx-interval 10
LAB1(config)# 
LAB1(config)# 
LAB1(config)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# system management-address vlan 1 v6
**Notice: IPv6 address update required for vlan1 interface.
LAB1(config)# 
LAB1(config)# 
LAB1(config)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet uni uni1
LAB1(config-uni)# del service evc1
LAB1(config-uni)# del service evc2
LAB1(config-uni)# no map interface
LAB1(config-uni)# ethernet uni del uni1
LAB1(config)# 
LAB1(config)# 
LAB1(config)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet nni nni1
LAB1(config-nni)# del service evc2
ethernet nni del nni1


end
config terminal
ethernet service del evc1
ethernet service del evc2


end
config terminal


no vlan 2-2




end
