

##### LACP Basic Test #####


config terminal

LAB1# 
LAB1# ##### LACP Basic Test #####
LAB1# 
LAB1# 
LAB1# 

end
config terminal
ethernet service add evc1
svlan 1
service type evpl


end
config terminal
ethernet nni add nni1
map interface 1/25

add service evc1


end
config terminal
ethernet uni add uni1
config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# 
LAB1(config)# 
LAB1(config)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet service add evc1
LAB1(config-svc)# svlan 1
LAB1(config-svc)# service type evpl
LAB1(config-svc)# 
LAB1(config-svc)# 
LAB1(config-svc)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet nni add nni1
LAB1(config-nni)# map interface 1/25
LAB1(config-nni)# 
LAB1(config-nni)# add service evc1
LAB1(config-nni)# 
LAB1(config-nni)# 
LAB1(config-nni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# map interface 1/1
all-to-one-bundling disable
multiplex enable
bundling enable
max-svc 256


end
config terminal
ethernet uni uni1
add service evc1


end
config terminal
ethernet sep uni1-evc1
add vlan 1-4095


end
config terminal
ethernet nni nni1
no map interface
ethernet uni add uni1
LAB1(config-uni)# map interface 1/1
LAB1(config-uni)# all-to-one-bundling disable
LAB1(config-uni)# multiplex enable
LAB1(config-uni)# bundling enable
LAB1(config-uni)# max-svc 256
LAB1(config-uni)# 
LAB1(config-uni)# 
LAB1(config-uni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet uni uni1
LAB1(config-uni)# add service evc1
LAB1(config-uni)# 
LAB1(config-uni)# 
LAB1(config-uni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet sep uni1-evc1
LAB1(config-ep)# add vlan 1-4095
LAB1(config-ep)# 
LAB1(config-ep)# 
LAB1(config-ep)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet nni nni1
LAB1(config-nni)# 

end
config terminal
interface 1/23
channel-group 1 mode active
lacp timeout short
interface 1/24
channel-group 1 mode active
lacp timeout short


end
config terminal
ethernet nni nni1
map interface po1


end
config terminal
ethernet nni nni1
no map interface


end
config terminal
interface 1/23
no map interface
LAB1(config-nni)# 
LAB1(config-nni)# 
LAB1(config-nni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# interface 1/23
LAB1(config-if)# channel-group 1 mode active
LAB1(config-if)# lacp timeout short
LAB1(config-if)# interface 1/24
LAB1(config-if)# channel-group 1 mode active
LAB1(config-if)# lacp timeout short
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet nni nni1
LAB1(config-nni)# map interface po1
LAB1(config-nni)# 
LAB1(config-nni)# 
LAB1(config-nni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet nni nni1
LAB1(config-nni)# no map interface
LAB1(config-nni)# 
LAB1(config-nni)# 
LAB1(config-nni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# channel-group 1 mode passive
lacp timeout short
interface 1/24
channel-group 1 mode passive
lacp timeout short


end
config terminal
ethernet nni nni1
map interface po1


end
config terminal
port-channel 1 max-member 1


end
config terminal
port-channel 1 max-member 8


end
config terminal
ethernet nni nni1
no map interface


end
config terminal
interface range 1/23-1/24
interface 1/23
LAB1(config-if)# channel-group 1 mode passive
LAB1(config-if)# lacp timeout short
LAB1(config-if)# interface 1/24
LAB1(config-if)# channel-group 1 mode passive
LAB1(config-if)# lacp timeout short
LAB1(config-if)# 
LAB1(config-if)# 
LAB1(config-if)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet nni nni1
LAB1(config-nni)# map interface po1
LAB1(config-nni)# 
LAB1(config-nni)# 
LAB1(config-nni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# port-channel 1 max-member 1
LAB1(config)# 
LAB1(config)# 
LAB1(config)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# port-channel 1 max-member 8
LAB1(config)# 
LAB1(config)# 
LAB1(config)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# ethernet nni nni1
LAB1(config-nni)# no map interface
LAB1(config-nni)# 
LAB1(config-nni)# 
LAB1(config-nni)# end
LAB1# config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
LAB1(config)# lacp timeout long


end
config terminal
interface range 1/23-1/24
no channel-group


end
config terminal
ethernet uni uni1
del service evc1
no map interface
ethernet uni del uni1


end
config terminal
ethernet nni nni1
del service evc1
ethernet nni del nni1


end
config terminal
ethernet service del evc1


end
config terminal


end
